---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunInsideMinTreadDepthFailure
source: html/b70eec15-abb7-ffa1-6f86-9d64049aea56.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunInsideMinTreadDepthFailure Property

Please enter a positive value less than Actual Tread Depth on Stair Path (%Actual Tread Depth%).

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderRunInsideMinTreadDepthFailure { get; }
```